# Задача 1: Приветствие
# Напишите программу, которая запрашивает у пользователя его имя и выводит приветствие.
# Пример:
# Ввод: Кирилл
# Вывод: Привет, Кирилл!

print('Как ваше имя?')
name = input()
print(f'Привет, {name}!')


