# Задача 10: Уравнение прямой
# Напишите программу, которая находит значение y в уравнении прямой y = kx + b для заданных x, k и b.
# Пример:
# Ввод: k = 2, b = 3, x = 5
# Вывод: y = 13
'''nums_input= input('')
nums = nums_input.split(', ')
for i in range(len(nums)):

print(len(nums))

'''
'''
nums_input = input('>>> ')
nums = nums_input.split()
index_int = []
for i in range(len(nums)):
    if type(nums[i]) == "<class 'int'>":
        index_int.append(nums[i])
print(index_int)
print(type(1))
'''